Enterprise_Serivces/Prod/SilverGroup2/CSLRealmAssociationService/result1/Iteration1/t3_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/realmassociation/contracts/2010/05/IRealmAssociationService/GetAssociationBySecuritySettings</wsa:Action><wsa:MessageID>uuid:ab0d1043-d8b7-4566-a5ec-81ac01329cac</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslrealmassociationserviceqa1.testgs.pvt/RealmAssociationService.svc</wsa:To></soap:Header><soap:Body><GetAssociationBySecuritySettings xmlns="http://www.gamestop.com/services/csl/realmassociation/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><DistinguishingFactor xmlns="http://www.gamestop.com/services/csl/realmassociation/messages/2010/05">3</DistinguishingFactor><MaximumHashBitLength xmlns="http://www.gamestop.com/services/csl/realmassociation/messages/2010/05">123456789</MaximumHashBitLength><MinimumHashBitLength xmlns="http://www.gamestop.com/services/csl/realmassociation/messages/2010/05">123456789</MinimumHashBitLength></request></GetAssociationBySecuritySettings></soap:Body></soap:Envelope>